src/cf/DataProcessors/уатОтложенноеОбновлениеИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатОтложенноеОбновлениеИБ</Name>
			<Comment>Отложенное обновление информационной базы</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/уатУчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатУчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетПартийПоОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/уатОтложенноеОбновлениеИБ/Forms/ПереносОстатковПартийТоваровНаОрганизации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОбработки = КонецМесяца(ТекущаяДата())+1;
	Организация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(
		ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяОрганизация");
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ПометкаУдаления
	|	И НЕ Склады.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование");
	мсвСклады = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Склады.ЗагрузитьЗначения(мсвСклады);
	Склады.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПеренос(Команда)

	мсвСклады = Новый Массив;
	Для Каждого ТекЭлем Из Склады Цикл
		Если ТекЭлем.Пометка Тогда
			мсвСклады.Добавить(ТекЭлем.Значение);
		КонецЕсли;
	КонецЦикла;
	Если ДатаОбработки = '00010101' ИЛИ Организация.Пустая() ИЛИ мсвСклады.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, "Не указаны организация, дата переноса или склады.");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДатаОбработки", ДатаОбработки);
	СтруктураПараметров.Вставить("Организация", Организация);
	СтруктураПараметров.Вставить("Склады", Склады);
	ИнициализацияФормыДлительнойОперации("ПереносОстатковПартийТоваровНаОрганизации_2_2_27_1", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДатуПереносаПоУчетнойПолитике(Команда)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указана организация.");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриВыборе", Новый Структура("Организация", Организация), Истина);
	Оповещ = Новый ОписаниеОповещения("ПодобратьДатуПереносаПоУчетнойПолитикеЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.уатУчетнаяПолитика.ФормаСписка", ПараметрыФормы, ЭтаФорма,,,,
		Оповещ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДатуПереносаПоУчетнойПолитикеЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОбработки = Результат.Период;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаОбработкиПриИзменении(Элемент)
	ДатаОбработки = НачалоМесяца(ДатаОбработки);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСозданныеДокументы

&НаКлиенте
Процедура СозданныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДок = Неопределено;
	Если Поле.Имя = "СозданныеДокументыСписаниеТоваров" Тогда
		ТекДок = Элементы.СозданныеДокументы.ТекущиеДанные.СписаниеТоваров;
	ИначеЕсли Поле.Имя = "СозданныеДокументыВводОстатков" Тогда
		ТекДок = Элементы.СозданныеДокументы.ТекущиеДанные.ВводОстатков;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДок) Тогда
		ПоказатьЗначение(Неопределено, ТекДок);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СозданныеДокументыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыВыводаФормыДлительнойОперацииПриПроведении

&НаКлиенте
Процедура ИнициализацияФормыДлительнойОперации(ИмяОбработчика, ПараметрыОбработчика)

	ДлительнаяОперация = ВыполнениеОбработкиНаСервере(ИмяОбработчика, ПараметрыОбработчика);
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания       = Истина;
	НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;

	Обработчик = Новый ОписаниеОповещения("ПроверитьВыполнениеЗадания", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);

КонецПроцедуры

&НаСервере
Функция ВыполнениеОбработкиНаСервере(ИмяОбработчика, ПараметрыОбработчика)
	
	СозданныеДокументы.Очистить();
	КоличествоДокументов = 0;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Отложенное обновление: " + ИмяОбработчика;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.уатОтложенноеОбновлениеИБ." + ИмяОбработчика, ПараметрыОбработчика, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания(Операция, ДополнительныеПараметры) Экспорт
	
	Если Операция = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Операция.Статус = "Выполнено" Тогда
		Если ЭтоАдресВременногоХранилища(Операция.АдресРезультата) Тогда
			Данные = ПолучитьИзВременногоХранилища(Операция.АдресРезультата);
			
			Если Данные.РезультатЗавершения = ИСТИНА Тогда
				Если ПустаяСтрока(Данные.ТекстОшибок) Тогда
					ТекстПредупреждения = "Операция завершена успешно.";
				Иначе
					ТекстПредупреждения = "Операция завершена: " + Данные.ТекстОшибок;
				КонецЕсли;
			Иначе
				ТекстПредупреждения = "При выполнении переноса обнаружены ошибки: " + Символы.ПС + Данные.ТекстОшибок;
			КонецЕсли;
			ПоказатьПредупреждение(, ТекстПредупреждения);
			
			КоличествоДокументов = Данные.СозданныеДокументы.Количество();
			Если КоличествоДокументов > 0 Тогда
				Для Каждого ТекДок Из Данные.СозданныеДокументы Цикл
					НоваяСтрока = СозданныеДокументы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДок);
				КонецЦикла;
				
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДокументы;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ВызватьИсключение Операция.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
